In [30]:
import pandas as pd
import numpy as np

In [31]:
df1 = pd.read_csv('Data/Zeeman Effect/6A_splitting.csv')

In [32]:
df1

      alpha    I
0     5.459  0.4
1     5.454  0.4
2     5.449  0.4
3     5.443  0.4
4     5.438  0.4
...     ...  ...
2043 -5.433  1.2
2044 -5.438  1.2
2045 -5.443  1.2
2046 -5.449  0.8
2047 -5.454  0.8

[2048 rows x 2 columns]

In [33]:
df2 = pd.read_csv('Data/Zeeman Effect/6A_no_splitting.csv')

In [34]:
df2

      alpha    I
0     5.459  0.4
1     5.454  0.4
2     5.449  0.4
3     5.443  0.4
4     5.438  0.0
...     ...  ...
2043 -5.433  0.8
2044 -5.438  0.8
2045 -5.443  0.8
2046 -5.449  0.8
2047 -5.454  0.8

[2048 rows x 2 columns]

In [35]:
df_net = df1 + df2

In [36]:
df_net

       alpha    I
0     10.918  0.8
1     10.908  0.8
2     10.898  0.8
3     10.886  0.8
4     10.876  0.4
...      ...  ...
2043 -10.866  2.0
2044 -10.876  2.0
2045 -10.886  2.0
2046 -10.898  1.6
2047 -10.908  1.6

[2048 rows x 2 columns]

In [37]:
df_net = pd.concat([df1, df2])

In [38]:
df_net

      alpha    I
0     5.459  0.4
1     5.454  0.4
2     5.449  0.4
3     5.443  0.4
4     5.438  0.4
...     ...  ...
2043 -5.433  0.8
2044 -5.438  0.8
2045 -5.443  0.8
2046 -5.449  0.8
2047 -5.454  0.8

[4096 rows x 2 columns]

In [39]:
df_net.reset_index(drop=True)

      alpha    I
0     5.459  0.4
1     5.454  0.4
2     5.449  0.4
3     5.443  0.4
4     5.438  0.4
...     ...  ...
4091 -5.433  0.8
4092 -5.438  0.8
4093 -5.443  0.8
4094 -5.449  0.8
4095 -5.454  0.8

[4096 rows x 2 columns]

In [41]:
df_net.set_index(np.array(df_net['alpha']))

        alpha    I
 5.459  5.459  0.4
 5.454  5.454  0.4
 5.449  5.449  0.4
 5.443  5.443  0.4
 5.438  5.438  0.4
...       ...  ...
-5.433 -5.433  0.8
-5.438 -5.438  0.8
-5.443 -5.443  0.8
-5.449 -5.449  0.8
-5.454 -5.454  0.8

[4096 rows x 2 columns]